from prettytable import PrettyTable
import pylab

#pip install prettytable
#first table from list

Дата = ["02.11.2016","02.11.2016","02.11.2016","14.11.2016","14.11.2016","14.11.2016","22.11.2016","22.11.2016","22.11.2016"]
Кодринку = ["100","200","300","100","200","300","100","200","300"]
ЦінаКартопля = ["45","35","35","45","40","35","40","40","40"]
ЦінаКапуста = ["50","30","30","45","40","35","40","40","40"]
ЦінаЦибуля = ["70","50","45","60","50","45","60","50","60"]
table1 = PrettyTable(["Дата","Код ринку","Ціна Картопля","Ціна Капуста","Ціна Цибуля"])

for x in range(0,9):
    table1.add_row([Дата[x],Кодринку[x],ЦінаКартопля[x],ЦінаКапуста[x],ЦінаЦибуля[x]])

#second table from list
Кодринку = ["100","200","300"]
Найменуванняринку = ["Бесарабський","Житній","Володимирський"]
table2 = PrettyTable(["Код ринку","Найменування ринку"])

for x in range(0,3):
    table2.add_row([Кодринку[x],Найменуванняринку[x]])

#table output with number 100
Кодринку = ["100","100","100"]
Найменуванняринку = ["Бесарабський","Бесарабський","Бесарабський"]
Дата = ["02.11.2016","14.11.2016","22.11.2016"]
ЦінаКартопля = ["45.00","45.00","40.00"]
ЦінаКапуста = ["50.00","45.00","40.00"]
ЦінаЦибуля = ["70.00","60.00","60.00"]
СередняЦіна = ["55.00","50.00","46.67"]
table3 = PrettyTable(["Код ринку","Найменування ринку","Дата","ЦінаКартопля","ЦінаКапуста","ЦінаЦибуля","СередняЦіна"])

for x in range(0,3):
    table3.add_row([Кодринку[x],Найменуванняринку[x],Дата[x],ЦінаКартопля[x],ЦінаКапуста[x],ЦінаЦибуля[x],СередняЦіна[x]])

#table output with number 200
Кодринку = ["200","200","200"]
Найменуванняринку = ["Житній","Житній","Житній"]
Дата = ["02.11.2016","14.11.2016","22.11.2016"]
ЦінаКартопля = ["35.00","40.00","40.00"]
ЦінаКапуста = ["30.00","40.00","40.00"]
ЦінаЦибуля = ["50.00","50.00","50.00"]
СередняЦіна = ["38.33","36.66","50.00"]
table4 = PrettyTable(["Код ринку","Найменування ринку","Дата","ЦінаКартопля","ЦінаКапуста","ЦінаЦибуля","СередняЦіна"])

for x in range(0,3):
    table4.add_row([Кодринку[x],Найменуванняринку[x],Дата[x],ЦінаКартопля[x],ЦінаКапуста[x],ЦінаЦибуля[x],СередняЦіна[x]])

#table output with number 300
Кодринку = ["300","300","300"]
Найменуванняринку = ["Володимирський","Володимирський","Володимирський"]
Дата = ["02.11.2016","14.11.2016","22.11.2016"]
ЦінаКартопля = ["35.00","35.00","40.00"]
ЦінаКапуста = ["30.00","35.00","35.00"]
ЦінаЦибуля = ["45.00","45.00","60.00"]
СередняЦіна = ["36.67","38.33","45.00"]
table5 = PrettyTable(["Код ринку","Найменування ринку","Дата","ЦінаКартопля","ЦінаКапуста","ЦінаЦибуля","СередняЦіна"])
for x in range(0,3):
    table5.add_row([Кодринку[x],Найменуванняринку[x],Дата[x],ЦінаКартопля[x],ЦінаКапуста[x],ЦінаЦибуля[x],СередняЦіна[x]])

#data otput
proga = ["ПРОГРАММА РОЗРАХУНКУ ТА АНАЛІЗУ РИНКОВИХ ЦІН"]
table0 = PrettyTable(["ПРОГРАММА РОЗРАХУНКУ ТА АНАЛІЗУ РИНКОВИХ ЦІН"])
print(table0)

x=input("Натисніть [1], щоб вивести Статистичні дані, [2], щоб відкрити Довідник ринків, [3], для введення Коду ринку, [4], для виведення Графіка: ")
y=int
if(x=="1"):
    print("Статистичні дані про ринкові ціни" and table1)
if(x=="2"):
    print("Найменування ринку" and table2)
if(x=="3"):
    y=input('Введіть код ринку: ')
    if(y=="100"):
        print(table3)
    elif(y=="200"):
        print(table4)
    elif(y=="300"):
        print(table5)
if(x=="4"):
    xdata = [100, 100, 100, 200, 200, 200, 300, 300, 300] 
    ydata = [55, 50, 46.67, 38.33, 36.66, 50, 36.67, 38.33, 45] 
    pylab.bar (xdata, ydata) 
    pylab.show()